aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio_WIP_Infineon_data_size_debug.c
/*
typedef enum
{
    SDIO_1B_BLOCK    =  1,
    SDIO_2B_BLOCK    =  2,
    SDIO_4B_BLOCK    =  4,
    SDIO_8B_BLOCK    =  8,
    SDIO_16B_BLOCK   =  16,
	SDIO_32B_BLOCK  =   32,
    SDIO_64B_BLOCK   =  64,
    SDIO_128B_BLOCK  =  128,
    SDIO_256B_BLOCK  =  256,
    SDIO_512B_BLOCK  =  512,
    SDIO_1024B_BLOCK = 1024,
    SDIO_2048B_BLOCK = 2048
} sdio_block_size_t;
*/

//ANN: imp needs more buffer
//ALIGNED_PRE(4) static uint8_t       temp_dma_buffer[MAX(2*1024,WICED_LINK_MTU+ 64)] ALIGNED(4);
CYHAL_ALIGN_DMA_BUFFER(static uint32_t  _temp_dma_buffer[_CYHAL_SDIO_DMA_BUFFER_SIZE]);
static uint8_t*                     user_data;
static uint32_t                     user_data_size;
static sdio_block_size_t find_optimal_block_size    ( uint32_t data_size );
static void              sdio_prepare_data_transfer ( cyhal_transfer_t direction, sdio_block_size_t block_size, uint8_t* data, uint16_t data_size );
volatile uint32_t	current_command;

static whd_bus_transfer_direction_t current_transfer_direction;
static cy_semaphore_t  sdio_transfer_finished_semaphore;
//struct k_sem sdio_transfer_finished_semaphore;
static uint32_t sdio_get_blocksize_dctrl(sdio_block_size_t block_size);


static int sem_count;

#endif

#define HAL_SD_MODULE_ENABLED 1 //ANN added temp

#if defined(HAL_SD_MODULE_ENABLED)



/***************************************************************************************************
 *      Private macros
 **************************************************************************************************/

#define __SDMMC_GET_FLAG(SDMMCx, SDIO_FLAG_CTIMEOUT) __SDIO_GET_FLAG(SDMMCx, SDIO_FLAG_CTIMEOUT)
#define __SDMMC_CLEAR_FLAG(SDMMCx, SDIO_FLAG_CCRCFAIL) __SDIO_CLEAR_FLAG(SDMMCx, SDIO_FLAG_CCRCFAIL)
//#define __SDMMC_CMDTRANS_ENABLE(obj->hsd->Instance) __SDIO_CMDTRANS_ENABLE(obj->hsd->Instance)


/* Number of cycles for read/write operation complete */
#define _CYHAL_SDIO_RW_RETRY_CYCLES             (1000U)

#define _CYHAL_SDIO_400KHZ                      (400000U)

/* Masks for errors in an R5 response */
#define SDMMC_R5_COM_CRC_ERROR                  ((uint32_t)0x00008000U)
#define SDMMC_R5_ILLEGAL_COMMAND                ((uint32_t)0x00004000U)
#define SDMMC_R5_IO_CURRENT_STATE               ((uint32_t)0x00003000U)
#define SDMMC_R5_ERROR                          ((uint32_t)0x00000400U)
#define SDMMC_R5_FUNCTION_NUMBER                ((uint32_t)0x00000200U)
#define SDMMC_R5_OUT_OF_RANGE                   ((uint32_t)0x00000100U)
#define SDMMC_R5_ERRORBITS                      (SDMMC_R5_COM_CRC_ERROR   | \
                                                 SDMMC_R5_ILLEGAL_COMMAND | \
                                                 SDMMC_R5_ERROR           | \
                                                 SDMMC_R5_FUNCTION_NUMBER | \
                                                 SDMMC_R5_OUT_OF_RANGE)
/* Data Block Size */
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_2B          (2U)
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_4B          (4U)
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_8B          (8U)
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_16B         (16U)
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_32B         (32U)
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_64B         (64U)
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_128B        (128U)
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_256B        (256U)
#define _CYHAL_SDIO_DATA_BLOCK_SIZE_512B        (512U)

/* Set default SDIO priority */
#if !defined (CYHAL_SDIO_IRQ_PRIORITY)
    #define CYHAL_SDIO_IRQ_PRIORITY             (5U)
#endif /* !defined (CYHAL_SDIO_IRQ_PRIORITY) */



#if defined(WICED)
#define SDIO_TX_RX_COMPLETE_TIMEOUT_LOOPS    (100000)
//CYHAL_ALIGN_DMA_BUFFER(static uint32_t  temp_dma_buffer[_CYHAL_SDIO_DMA_BUFFER_SIZE]);
//ANN wiced has uint8_t
//static uint8_t  temp_dma_buffer[_CYHAL_SDIO_DMA_BUFFER_SIZE];
//static uint32_t  temp_dma_buffer[_CYHAL_SDIO_DMA_BUFFER_SIZE];
#endif

/***************************************************************************************************
 *      Private variables
 **************************************************************************************************/

static SD_HandleTypeDef* _cyhal_sdio_handle = NULL;
static SD_HandleTypeDef hsd;
static SDIO_InitTypeDef sdio_init_structure;
#if defined(WICED) //ANN taken from WICED
#define SDIO_TransferDir_ToCard             ((uint32_t)0x00000000)
#define SDIO_TransferDir_ToSDIO             ((uint32_t)0x00000002)

#define SDIO_TransferMode_Block             ((uint32_t)0x00000000)
#define SDIO_TransferMode_Stream            ((uint32_t)0x00000004)

#define SDIO_DPSM_Disable                    ((uint32_t)0x00000000)
#define SDIO_DPSM_Enable                     ((uint32_t)0x00000001)

//ANN modied below
//static uint8_t*                     dma_data_source;
static uint32_t*                     dma_data_source;
static uint32_t                     dma_transfer_size;

/*typedef enum
{
     If updating this enum, the bus_direction_mapping variable will also need to be updated
    BUS_READ,
    BUS_WRITE
} wwd_bus_transfer_direction_t;*/

static const uint32_t bus_direction_mapping[] =
{
    [BUS_READ]  = SDIO_TransferDir_ToSDIO,
    [BUS_WRITE] = SDIO_TransferDir_ToCard
};

static bool sdio_transfer_failed;

#endif
/***************************************************************************************************
 *      Private functions
 **************************************************************************************************/
//ANN: replaced SDMMC_TypeDef by SDIO_TypeDef as the stm32f429xx.h has sdio instead sdmmc
static uint32_t _stm32_sdio_cmd_rw_extended(SDIO_TypeDef* SDMMCx, uint32_t argument,
                                            uint32_t* response);
static uint32_t _stm32_sdio_cmd_send_op_cond(SDIO_TypeDef* SDMMCx);

static uint32_t _stm32_sdio_cmd_rw_direct(SDIO_TypeDef* SDMMCx, uint32_t argument,
                                          uint32_t* response);
static uint32_t _stm32_sdio_convert_block_size(uint16_t block_size);
static uint32_t _stm32_sdio_find_optimal_block_size(uint32_t data_size);

