aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio_WIP_Infineon_data_size_debug.c
    /* Update obj sd handle */
    if (obj->hsd == NULL)
    {
        obj->hsd = _cyhal_sdio_handle;
    }

    hsd.Instance = SDIO;

/*
#if defined (WICED)
       //*!< Enable the SDIO AHB Clock and the DMA2 Clock
       //RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_DMA2, ENABLE );
       //RCC_APB2PeriphClockCmd( RCC_APB2Periph_SDIO, ENABLE );

#if defined (SDIO)
    {
    	if (obj->hsd->Instance == SDIO)
    	{
    	do {
    	   __IO uint32_t tmpreg;
    	   //SET_BIT(RCC->AHB2ENR, 0x00000200);
    	   SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);

    	   // Delay after an RCC peripheral clock enabling
    	   tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);
    	   UNUSED(tmpreg);
    	   } while(0);
    	}
    }
    #endif
#endif //WICED
*/


    /* Do not change frequency if requested value is zero */
    if (config->frequencyhal_hz != 0u)
    {
        /* Override the SDMMC Clock frequency Configuration if defined */
        #ifdef SDMMC_CLK_FREQ_OVERRIDE
        clk_freq = SDMMC_CLK_FREQ_OVERRIDE;
        #else
        clk_freq = config->frequencyhal_hz;
        #endif
        obj->frequencyhal_hz = clk_freq;

        /* Calculate SDMMC Clock divider. */
        /* ClockDiv = SDMMC input clock / (2 * Expected SDMMC Clock) */
        //uint32_t sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(STM32_RCC_PERIPHCLK_SDMMC);

        uint32_t sdmmc_clk = LL_RCC_GetSDIOClockFreq(LL_RCC_SDIO_CLKSOURCE);
        obj->hsd->Init.ClockDiv = _stm32_safe_divide(sdmmc_clk, 2U * clk_freq);

        //ANN commented as CKCR.CLKEN bit is getting reset & causing CMD52 to CMDACT flag set always
        /* Reset and Enable SDIO block */
        //_stm32_sdio_enable_hw_block(obj);
    }

    /* Do not change block size if requested value is zero */
    if (config->block_size != 0u)
    {
        obj->block_size = config->block_size;
    }

    return CY_RSLT_SUCCESS;
}


/***************************************************************************************************
 * cyhal_sdio_send_cmd
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_send_cmd(const cyhal_sdio_t* obj, cyhal_transfer_t direction,
                              cyhal_sdio_command_t command, uint32_t argument, uint32_t* response)
{
    (void)direction;
    uint32_t ret;
    /* Check the parameters */
    assert_param(obj != NULL);
    assert_param(obj->hsd != NULL);



   switch (command)
    {
        /* CMD0 */
        case CYHAL_SDIO_CMD_GO_IDLE_STATE:
        	ret = SDMMC_CmdGoIdleState(obj->hsd->Instance);
            break;

        /* CMD3 */
        case CYHAL_SDIO_CMD_SEND_RELATIVE_ADDR:
        {
            uint16_t resp;
            assert_param(response != NULL);
            ret = SDMMC_CmdSetRelAdd(obj->hsd->Instance, &resp);
            *response = resp;
            //*response = resp<<16; //In WICED, we are not bothered about different error flags as in function ll "SDMMC_GetCmdResp6"
            // we are getting the same R6 reponse of 0x10000 there, but its been >>16 times based on some flag setting
            break;
        }

        /* CMD5 */
        case CYHAL_SDIO_CMD_IO_SEND_OP_COND:
        	ret = _stm32_sdio_cmd_send_op_cond(obj->hsd->Instance);
        	  // *response = SDIO->RESP1; //ANN added this from WICED
        	break;

        /* CMD7 */
        case CYHAL_SDIO_CMD_SELECT_CARD:
        	ret = SDMMC_CmdSelDesel(obj->hsd->Instance, (uint64_t)argument << 16);
        	//ret = SDMMC_CmdSelDesel(obj->hsd->Instance, (uint64_t)argument);
            break;

        /* CMD52 */
        case CYHAL_SDIO_CMD_IO_RW_DIRECT:
            /* this one already has  != NULL check inside */
            ret = _stm32_sdio_cmd_rw_direct(obj->hsd->Instance, argument, response);
            break;

        /* CMD53 */
        case CYHAL_SDIO_CMD_IO_RW_EXTENDED:
            /* this one already has  != NULL check inside */
            ret = _stm32_sdio_cmd_rw_extended(obj->hsd->Instance, argument, response);
            break;

        case CYHAL_SDIO_CMD_GO_INACTIVE_STATE:
        default:
            ret = CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
            break;
    }
    return ret;
}


/***************************************************************************************************
 * cyhal_sdio_bulk_transfer
 **************************************************************************************************/
#if(0)
cy_rslt_t cyhal_sdio_bulk_transfer(cyhal_sdio_t* obj, cyhal_transfer_t direction, uint32_t argument,
                                   const uint32_t* data, uint16_t length, uint32_t* response)
{
    uint32_t loop_count = 0;
    whd_result_t result;
    uint16_t attempts = 0;

    sdio_block_size_t block_size;
    uint16_t data_size = length;

    //ANN added below
    current_command = CYHAL_SDIO_CMD_IO_RW_EXTENDED;

   //whd_assert("Bad args", !((command == CYHAL_SDIO_CMD_IO_RW_EXTENDED) && (data == NULL)));

    if ( response != NULL )
    {
        *response = 0;
    }

    //platform_mcu_powersave_disable();

    /* Ensure the bus isn't stuck half way through transfer */
    DMA2_Stream3->CR   = 0;

restart:
    SDIO->ICR = (uint32_t) 0xFFFFFFFF;
    sdio_transfer_failed = 0;
    ++attempts;

    /* Check if we've tried too many times */
    if (attempts >= (uint16_t) BUS_LEVEL_MAX_RETRIES)
    {
    	//ANN temp
        result = 1051; //WWD_SDIO_RETRIES_EXCEEDED; this prpares the exception to return, so skipped now
        WPRINT_WHD_DEBUG( ("J_WWD_SDIO_RETRIES_EXCEEDED, attmpts=%d\n",attempts) );
        goto exit;
    }
    /* Prepare the data transfer register */

    //if ( command == SDIO_CMD_53 )
    {
        //sdio_enable_bus_irq();
    	SDIO->MASK = SDIO_MASK_SDIOITIE | SDIO_MASK_CMDRENDIE | SDIO_MASK_CMDSENTIE;

        /* Dodgy STM32 hack to set the CMD53 byte mode size to be the same as the block size */

        //if ( mode == SDIO_BYTE_MODE )
        {
            block_size = find_optimal_block_size( data_size );
            if ( block_size < SDIO_512B_BLOCK )
            {
                argument = ( argument & (uint32_t) ( ~0x1FF ) ) | block_size;
            }
            else
            {
                argument = ( argument & (uint32_t) ( ~0x1FF ) );
            }
        }

        /* Prepare the SDIO for a data transfer */
        current_transfer_direction = direction;
        sdio_prepare_data_transfer( direction, block_size, (uint8_t*) data, data_size );

