aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio_WIP_Infineon_data_size_debug.c
    // D0 - D3 enable pullups (bi-directional)
	gpio_mode_setup(GPIOC, GPIO_MODE_AF, GPIO_PUPD_PULLUP,
                    GPIO8 | GPIO9 | GPIO10 | GPIO11);
    // CLK line no pullup
	gpio_mode_setup(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE,  GPIO12);

	gpio_set_af(GPIOC, GPIO_AF12,
                GPIO8 | GPIO9 | GPIO10 | GPIO11 | GPIO12);
    gpio_set_af(GPIOD, GPIO_AF12, GPIO2);

    /* GPIOD setup */
	gpio_set_output_options(GPIOD, GPIO_OTYPE_PP, GPIO_OSPEED_25MHZ, GPIO2);
	gpio_mode_setup(GPIOD, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO2);

#ifdef SDIO_HAS_CARD_DETECT
    /* SDIO Card Detect pin on the Embest Baseboard */
    /*     PB15 as a hacked Card Detect (active LOW for card present) */
    gpio_mode_setup(GPIOB, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, GPIO15);
#endif
}

#endif





//ANN commented
#endif /* defined(HAL_SDMMM_MODULE_ENABLED) */

cy_rslt_t cyhal_sdio_bulk_transfer(cyhal_sdio_t* obj, cyhal_transfer_t direction, uint32_t argument,
                                   const uint32_t* data, uint16_t length, uint32_t* response, sdio_transfer_mode_t mode)
{
    cy_rslt_t result = CYHAL_SDIO_RSLT_CANCELED;
   // CYHAL_ALIGN_DMA_BUFFER(static uint32_t  _temp_dma_buffer[_CYHAL_SDIO_DMA_BUFFER_SIZE]);
    DMA_HandleTypeDef hdma;

    WPRINT_WHD_INFO( ("J_cyhal_sdio_bulk_transfer\n") );

    hdma.Instance = DMA2_Stream3;

    //ANN added below
    current_command = CYHAL_SDIO_CMD_IO_RW_EXTENDED;

    /* Check data buffer if aligned on 32-bytes (needed for cache maintenance purpose),
     * and Length is multiple by block size. If NOT, use internal buffer for DMA */
    bool use_temp_dma_buffer = (((uint32_t)data % _CYHAL_DMA_BUFFER_ALIGN_BYTES) != 0u) ||
                               ((length % obj->block_size) != 0u);

    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(0u != length);
    assert_param(!use_temp_dma_buffer || (length <= sizeof(_temp_dma_buffer)));

    SDIO_DataInitTypeDef config;
    sdio_cmd_argument_t   arg = { .value = argument };

    uint32_t  timeout = _CYHAL_SDIO_RW_RETRY_CYCLES;
    uint32_t  number_of_blocks;
    uint32_t  block_size;
    uint32_t  flags;
    uint32_t* p_dma_buffer = NULL;

    uint16_t data_size;

    /* Ensure the bus isn't stuck half way through transfer */
    DMA2_Stream3->CR   = 0;

    if (obj->hsd->State == HAL_SD_STATE_READY)
    {
    	//ANN from WICED to enable IRQ
    	SDIO->MASK = SDIO_MASK_SDIOITIE | SDIO_MASK_CMDRENDIE | SDIO_MASK_CMDSENTIE;

    	/* Block size not initialized */
        if (obj->block_size == 0U)
        {
            obj->block_size = _CYHAL_SDIO_DATA_BLOCK_SIZE_64B;
        }

        /* Block mode */
        if (length >= obj->block_size)
        {
            block_size       = obj->block_size;
            number_of_blocks = (length + block_size - 1u) / block_size;
        }
        /* Byte mode */
        else
        {
            block_size       = _stm32_sdio_find_optimal_block_size(length);
            number_of_blocks = 1UL;
        }

        /* Set the CMD53 byte mode size to be the same as the block size */
        if (arg.cmd53.block_mode == 0U)
        {
            if (_stm32_sdio_find_optimal_block_size(arg.cmd53.count) <
                _CYHAL_SDIO_DATA_BLOCK_SIZE_512B)
            {
                arg.cmd53.count = _stm32_sdio_find_optimal_block_size(arg.cmd53.count);
            }
            else
            {
                arg.cmd53.count = 0u;
            }
        }

        obj->hsd->ErrorCode = HAL_SD_ERROR_NONE;
        obj->hsd->State     = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        obj->hsd->Instance->DCTRL = 0u;

        if (use_temp_dma_buffer)
        {
            if ((length == 0) || (length > sizeof(_temp_dma_buffer)))
            {
                obj->hsd->State = HAL_SD_STATE_READY;
                return CYHAL_SDIO_BAD_ARGUMENT;
            }

            /* Using internal buffer */
            p_dma_buffer = _temp_dma_buffer;

            /* Clean internal buffer and copy data */
            (void)memcpy((void*)_temp_dma_buffer, (void*)data, length);

            if (length != sizeof(_temp_dma_buffer))
            {
                (void)memset((void*)&((uint8_t*)_temp_dma_buffer)[length], 0,
                             sizeof(_temp_dma_buffer) - length);
            }
        }
        else
        {
            /* Use app data buffer */
            p_dma_buffer = (uint32_t*)data;
        }

        /* Maintenance D-cache for DMA buffers */
        #if defined(_CYHAL_DCACHE_MAINTENANCE)
        if (direction == CYHAL_WRITE)
        {
            SCB_CleanDCache_by_Addr((uint32_t*)p_dma_buffer, block_size * number_of_blocks);
        }
        else
        {
            /* Cache-Invalidate the output from DMA */
            SCB_InvalidateDCache_by_Addr((uint32_t*)p_dma_buffer, block_size * number_of_blocks);
        }
        #endif /* if defined(_CYHAL_DCACHE_MAINTENANCE) */


        WPRINT_WHD_DEBUG( ("J_length=%d,\targ.cmd53.count=%d\tBlock mode.block_size=%d,\tnumber_of_blocks=%d \n",length, arg.cmd53.count,block_size,number_of_blocks ) );


       //sdio_prepare_data_transfer( direction, block_size, (uint8_t*) data, length/*(block_size * number_of_blocks)*/ );
        //sdio_prepare_data_transfer( direction, block_size, (uint8_t*) data, arg.cmd53.count );

        data_size = block_size * number_of_blocks;

        sdio_prepare_data_transfer( direction, block_size, (uint8_t*) data, data_size );


        /* DMA2 Stream3 */
        DMA2_Stream3->CR   = 0;
        DMA2->LIFCR        = (uint32_t) ( 0x3F << 22 );
        DMA2_Stream3->FCR  = (uint32_t) ( 0x00000021 | DMA_FIFOMODE_ENABLE | DMA_FIFO_THRESHOLD_FULL );
        		//FCR= 00-100-1-11 => 00-fifo status is empty-directmode disabled-full FIFO
        DMA2_Stream3->PAR  = (uint32_t) &SDIO->FIFO;
        //DMA2_Stream3->M0AR = (uint32_t) dma_data_source;
        DMA2_Stream3->M0AR = (uint32_t) p_dma_buffer;
        //DMA2_Stream3->NDTR = ((uint32_t) ( ( ( arg.cmd53.count + (uint16_t) block_size - 1 ) / (uint16_t) block_size ) * (uint16_t) block_size )) / 4;


        dma_transfer_size = (uint32_t) ( ( ( data_size + (uint16_t) block_size - 1 ) / (uint16_t) block_size ) * (uint16_t) block_size );
        DMA2_Stream3->NDTR = dma_transfer_size / 4;
        WPRINT_WHD_DEBUG( ("J_NDTR=%d\n",DMA2_Stream3->NDTR) );
        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut = SDMMC_DATATIMEOUT;
        config.TransferDir = (direction == CYHAL_WRITE) ? SDIO_TRANSFER_DIR_TO_CARD :
                             SDIO_TRANSFER_DIR_TO_SDIO;
        config.TransferMode  = SDIO_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDIO_DPSM_DISABLE;
        config.DataLength    = block_size * number_of_blocks;
        config.DataBlockSize = _stm32_sdio_convert_block_size((uint16_t)block_size);

        obj->hsd->Instance->DCTRL |= SDIO_DCTRL_SDIOEN; /* SD I/O enable functions */

        (void)SDIO_ConfigData(obj->hsd->Instance, &config);

 //ANN commented below for sometime. Below macro does ORing with SDMMC_CMD_CMDTRANS which is for CPSM Treating command as a Data Transfer
       // __SDMMC_CMDTRANS_ENABLE(obj->hsd->Instance);

